# 选择电脑

## 硬件配置

选择一个适用与微生物领域的生物信息学学习和分析，特别是高通量测序数据的个人电脑，是个很宽泛的话题，原则上来说当然是性能越高越好。对于普通的项目，应该追求哪些性能呢？个人认为值得花钱在追求的有：

* 更多的CPU核心和线程
* 更多的内存
* 更快速的硬盘

其他值得考虑的，包括更大的显示器和更强悍的GPU。显示器大比较适合多窗口的操作，这取决于个人喜好和追求。另外如果需要提升速度，比如搞组装、进化、AI分析等，可以考虑使用GPU。但这大大增加成本，也不是一般微生物项目需要追求的。

### CPU

个人电脑选择中，台式机可以考虑intel i7-8700以上的，或者AMD 2700级别的多核CPU。如果是笔记本必然要放弃高性能，如果单纯学习i7-8250以上的即可（保留足够的便携性），如果日常分析建议i7-8750H级别的CPU。

### 内存

微生物基因组组装工具很多，但是目前多kmer分析的 spades 简单好用，比较值得推荐。它需要至少16G的内存进行分析，因此在选择配置时请别选8G的电脑了。对于宏基因组，特别是 wgs metagenomics，内存越大越好，一般推荐在128G以上。这个配置目前普通个人电脑达不到，因此如果做这个分析建议用服务器。

### 硬盘

推荐上SSD，特别是如果用 nanopore minion 测序仪，最好是上512G以上的SSD。但是生物数据非常大，单纯的大容量SSD太贵，所以还是SSD加配一个2T以上的HD来储存数据比较划算。笔记本

### 笔记本机型

台式机自己组装兼容机即可，而笔记本目前市面上如果内存16G以上的往往是走游戏本路线的，会给你添加游戏显卡这一不需要的额外开销。综合下来看，可以考虑的笔记本有Apple Mac Pro，小米15pro，dell 13/15xps等。显示器分辨率1920x1080即可，目前4K分辨率显示效果缺失很细腻，特别是终端下。但是java目前对4K支持不理想，很多软件如IGV在4K下太小看不清，所以没必要化额外的费用追求这个属性。

## 操作系统

个人只考虑Linux。win10的shell环境、apple的都不用考虑了，要学习生物信息就必须逼迫自己在linux环境中解决一切问题，才能快速的提高。Linux发行版众多，以前我会考虑ubuntu+Gnome，因为用户较多，教程和软件包也比较丰富，比较适合新手和小白入门。现在我使用archlinux+i3，自己配置整个环境，用的比较顺手。后续的内容会以archlinux+i3做为背景进行。linux发行版和桌面本身没有高贵与低贱，选择自己适合的就行。
